RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author = current_user
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Super awesome speed run"], ["url", ""], ["content", ""], ["author_id", 1], ["created_at", "2022-03-18 20:53:10.804119"], ["updated_at", "2022-03-18 20:53:10.804119"]]