RedditClone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hydrohomies"], ["description", "asdfasdf"], ["moderator_id", 1], ["created_at", "2022-03-18 19:15:00.719795"], ["updated_at", "2022-03-18 19:15:00.719795"]]